---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireTypeSet
source: html/4f6ebbaa-4a8c-6b4d-ece4-9a736adbbbb4.htm
---
# WireTypeSet Methods

Removes every wire type from the set, rendering it empty.